<a href="https://colab.research.google.com/github/Jagadeeshkavuri1/ML_assignment/blob/main/assianment-2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import pandas as k

#(1) i) Create a Pandas DataFrame from the following dictionary:

In [4]:
data = {
'Name': ['Alice', 'Bob', 'Carol'],
'Age': [24, 27, 22],
'Salary': [50000, 55000, 48000]
}
d=k.DataFrame(data)
print("the dataframe of the give data is \n",d)

the dataframe of the give data is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000

##(ii)Add a new column called Bonus which is 10% of the salary.

In [6]:
print(d)
print("---------------------------")
d['Bonus'] = d['Salary'] * 0.10
print(d)

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
---------------------------
    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0

#2) Given the DataFrame created in the above question:

##(i)Display the first two rows.

In [7]:
print("the dataframe is \n",d)
print("the first two rows of the above data frame is \n")
d1=d.head(2)
print(d1)

the dataframe is
     Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0
the first two rows of the above data frame is

    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0

##(ii)Compute the mean salary

In [9]:
print("the dataframe is \n",d)
m_sal=d['Salary'].mean()
print("mean of the salary is : ",m_sal)

the dataframe is
     Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0
mean of the salary is :  51000.0

#3) Using the same DataFrame:

##(i) Extract all rows where the Age is greater than 25.

In [10]:
print("the dataframe is \n",d)
grea_age=d[d['Age']>25]
print("age is greatther than 25 is \n",grea_age)

the dataframe is
     Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0
age is greatther than 25 is
   Name  Age  Salary   Bonus
1  Bob   27   55000  5500.0

##(ii) Filter out rows where the Salary is less than 50000.

In [11]:
print("the dataframe is \n",d)
sal=d[d['Salary']<50000]
print("salary is lesser than 50000 is \n",sal)

the dataframe is
     Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0
salary is lesser than 50000 is
     Name  Age  Salary   Bonus
2  Carol   22   48000  4800.0

#4) Create the following DataFrame:

In [12]:
data1 = {
'A': [1, 2, None, 4],
'B': [None, 2, 3, None],
'C': [1, 2, 3, 4]
}
d2=k.DataFrame(data1)
d1=d2
print("the dataframe is\n\n ",d2)

the dataframe is

       A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4

##(i) Fill missing values in column A with the mean of the column.

In [13]:
print("origiinal dataframe is\n :",d1)
d2['A'] = d2['A'].fillna(d2['A'].mean())
print(d2)

origiinal dataframe is
 :      A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

##(ii)Drop rows where all values are None.

In [14]:
print('original dataframe is\n ',d1)
d_drop_col = d2.dropna(how='all')
print("remove the all none rows of dataframe \n ")
print(d_drop_col)

original dataframe is
            A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4
remove the all none rows of dataframe

          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

#(5) Create a DataFrame for employees

In [15]:
data3 = {
'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
'Salary': [50000, 45000, 60000, 65000, 70000]
}
d4=k.DataFrame(data3)
print("the dataframe of the data is ")
print(d4)

the dataframe of the data is
  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   45000
2         IT    Carol   60000
3         IT    David   65000
4    Finance      Eve   70000

##i) Group the data by Department and compute the total and mean salary for each department.

In [16]:
grouped = d4.groupby('Department')['Salary'].agg(['sum', 'mean'])

print(grouped)

               sum     mean
Department
Finance      70000  70000.0
HR           95000  47500.0
IT          125000  62500.0

#(6)Perform an inner join on the ID column.  Given two DataFrames

In [17]:
df1 = k.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
print("the first dataframe is \n",df1)

df2 = k.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
print("the second dataframes is \n",df2)
m=k.merge(df1,df2,how='inner',on='ID')
print("after perform inner join \n",m)

the first dataframe is
    ID   Name
0   1  Alice
1   2    Bob
2   3  Carol
the second dataframes is
    ID  Age
0   2   25
1   3   30
2   4   22
after perform inner join
    ID   Name  Age
0   2    Bob   25
1   3  Carol   30

#(7)Given a small dataset, clean and display basic statistics using Pandas.

In [19]:
import pandas as pd
data9 = {
    'Name': ['Alice', 'Bob', 'Carol'],
    'Age': [25, 30, None],
    'Salary': [50000, 55000, 60000],
    'Department': ['HR', 'IT', 'Finance']
}
df9 = pd.DataFrame(data9)

print("Original DataFrame:")
print(df9)
df9['Age'] = df9['Age'].fillna(df9['Age'].mean())

df9 = df9.drop_duplicates()

print("\nDataFrame after cleaning:")
print(df9)
print("\nBasic Statistics:")
print(df9.describe())

print("\nDataFrame Info:")
df9.info()

Original DataFrame:
    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   55000         IT
2  Carol   NaN   60000    Finance

DataFrame after cleaning:
    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   55000         IT
2  Carol  27.5   60000    Finance

Basic Statistics:
         Age   Salary
count   3.00      3.0
mean   27.50  55000.0
std     2.50   5000.0
min    25.00  50000.0
25%    26.25  52500.0
50%    27.50  55000.0
75%    28.75  57500.0
max    30.00  60000.0

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Age         3 non-null      float64
 2   Salary      3 non-null      int64
 3   Department  3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

#(8) small EDA task

##(i)Load the Titanic dataset (titanic.csv) into a Pandas DataFrame

In [32]:
p1=k.read_csv('/content/Titanic-Dataset (1).csv')
p2=k.DataFrame(p1)
print("the titanic dataframe is \n",p2)

the titanic dataframe is
      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

##(ii)Perform the following tasks:

##1.Display the number of missing values in each column.

##2.Find the average age of passengers.

##3.Create a bar plot to show the survival rate based on gender.

#(9)Data Transformation Load a dataset containing daily temperatures and dates. Perform the following:

In [20]:
data5 = {
    'Date': ['2024-12-01', '2024-12-02', '2024-12-03', '2024-12-04', '2024-12-05'],
    'Temperature': [30, 25, 18, 35, 22]
}
g4=k.DataFrame(data5)
print(g4)

         Date  Temperature
0  2024-12-01           30
1  2024-12-02           25
2  2024-12-03           18
3  2024-12-04           35
4  2024-12-05           22

##(i) Convert the date column into a DateTime object.

In [21]:
print("the dataframe is\n ",g4)
g4['Date'] = k.to_datetime(g4['Date'])
print("after convert date colum into datatime object\n")
print(g4)

the dataframe is
           Date  Temperature
0  2024-12-01           30
1  2024-12-02           25
2  2024-12-03           18
3  2024-12-04           35
4  2024-12-05           22
after convert date colum into datatime object

        Date  Temperature
0 2024-12-01           30
1 2024-12-02           25
2 2024-12-03           18
3 2024-12-04           35
4 2024-12-05           22

##(ii)o Create a new column that categorizes temperatures into High, Medium, or Low.

In [22]:
def categorize_temperature(temp):
    if temp >= 30:
        return 'High'
    elif temp >= 20:
        return 'Medium'
    else:
        return 'Low'

g4['Temperature Category'] = g4['Temperature'].apply(categorize_temperature)
print("after addiing column ")
print(g4)

after addiing column
        Date  Temperature Temperature Category
0 2024-12-01           30                 High
1 2024-12-02           25               Medium
2 2024-12-03           18                  Low
3 2024-12-04           35                 High
4 2024-12-05           22               Medium